<template>
  <div class="update-log-page">
    <ul>
      <li v-for="(log, version) in updateLogs" :key="version">
        <strong>v{{ version }}:</strong> {{ log }}
      </li>
    </ul>
  </div>
</template>

<script>
export default {
  name: 'UpdateLog',
  data() {
    return {
      updateLogs: {
        '1.1.26': 'MES系统更新V1.1.26_库存管理（修改用户交互操作逻辑Bug，增加日志记录详情）；',
        '1.1.25': 'MES系统更新V1.1.25_库存管理（修改山西大钧库存批量导入Bug）；',
        '1.1.24': 'MES系统更新V1.1.24_库存管理（适配嘉立创物品快速录入-第一版）；',
        '1.1.23': 'MES系统更新V1.1.23_新版本库存管理操作交互优化；',
        '1.1.22': 'MES系统更新V1.1.22_新版本库存管理操作交互优化以及修改相关Bug；',
        '1.1.21': 'MES系统更新V1.1.21_新版本存管理完善批量出入库功能样式以及修改导入上一篇等功能Bug；',
        '1.1.20': 'MES系统更新V1.1.20_新版本存管理完善批量导入功能以及修改测试Bug；',
        '1.1.19': 'MES系统更新V1.1.19_新版本存管理完善导入上一篇功能以及修改测试Bug；',
        '1.1.18': 'MES系统更新V1.1.18_新版本存管理完善操作记录日志接口；',
        '1.1.17': 'MES系统更新V1.1.17_新版本存管理整合资产流转部分逻辑；',
        '1.1.16': 'MES系统更新V1.1.16_新版本存管理修复测试Bug-2；',
        '1.1.15': 'MES系统更新V1.1.15_新版本存管理修复测试Bug-1；',
        '1.1.14': 'MES系统更新V1.1.14_新版本存管理-2（支持储物箱管理）修复测试Bug若干；',
        '1.1.13': 'MES系统更新V1.1.13_新版本存管理-1(页面样式调整)；',
        '1.1.12': 'MES系统更新V1.1.12_升级库存管理页面样式以及修复部分Bug；',
        '1.1.11': 'MES系统更新V1.1.11_修改库存管理页面图片预览样式以及修复部分Bug；',
        '1.1.10': 'MES系统更新V1.1.10_新增修改库存管理接口和页面样式以及修复部分Bug；',
        '1.1.09': 'MES系统更新V1.1.09_新增修改部分聊天接口和页面样式；',
        '1.1.08': 'MES系统更新V1.1.08_新增聊天页面-修改上一版本使用Bug；',
        '1.1.07': 'MES系统更新V1.1.07_新增聊天页面-修改上一版本使用Bug；',
        '1.1.06': 'MES系统更新V1.1.06_新增库存页面-修改上一版本使用Bug；',
        '1.1.05': 'MES系统更新V1.1.05_修改任务页面（文件预览和下载链接地址）；',
        '1.1.04': 'MES系统更新V1.1.04_调整首页组件页面样式；',
        '1.1.03': 'MES系统更新V1.1.03_修改请求路径(相对路径-/ss-proxyp35001)；',
        '1.1.02': 'MES系统更新V1.1.02_更改页面路由跳转逻辑；',
        '1.1.01': 'MES系统更新V1.1.01_系统组件升级（页面样式重构）；',
        '1.0.11': 'MES系统更新V1.0.11_开发任务模块页面；',
        '1.0.10': 'MES系统更新V1.0.10_开发文件分享模块；',
        '1.0.09': 'MES系统更新V1.0.09_开发项目列表模块；',
        '1.0.08': 'MES系统更新V1.0.08_开发项目日历模块；',
        '1.0.07': 'MES系统更新V1.0.07_开发知识库模块；',
        '1.0.06': 'MES系统更新V1.0.06_开发文件列表模块；',
        '1.0.05': 'MES系统更新V1.0.05_开发后台使用统计模块；',
        '1.0.04': 'MES系统更新V1.0.04_开发进度跟踪模块；',
        '1.0.03': 'MES系统更新V1.0.04_开发进度跟踪模块；',
        '1.0.02': 'MES系统更新V1.0.04_开发进度跟踪模块；',
        '1.0.01': 'MES系统更新V1.0.04_系统框架搭建完成；',
      }
    };
  }
};
</script>

<style scoped>
.update-log-page {
  padding: 20px;
}
.update-log-page h2 {
  text-align: center;
}
.update-log-page ul {
  list-style-type: none;
  padding: 0;
}
.update-log-page li {
  margin-bottom: 10px;
}
</style>
